Step 1: Configure loopbacks and assign addresses.
x. Cable the network as shown in the topology diagram. Erase the startup configuration, and reload 
each router to clear previous configurations.
y. Using the addressing scheme in the diagram, create the loopback interfaces and apply IP 
addresses to these and the serial interfaces on R1, R2, R3, and R4. On the serial interfaces 
connecting R1 to R3 and R3 to R4, specify the bandwidth as 64 Kb/s and set a clock rate on the 
DCE using the clock rate 64000 command. On the serial interfaces connecting R1 to R2 and R2 to 
R3, specify the bandwidth as 128 Kb/s and set a clock rate on the DCE using the clock rate 
128000 command.
You can copy and paste the following configurations into your routers to begin.
Note: Depending on the router model, interfaces might be numbered differently than those listed. You 
might need to alter them accordingly.
Router R1
interface Lo1
ip address 192.168.1.1 255.255.255.0
nterface Serial0/0/0
ip address 172.16.12.1 255.255.255.248
no shutdown
interface Serial0/0/1
ip address 172.16.13.1 255.255.255.248
no shutdown
End
Router R2
interface Lo2
ip address 192.168.2.1 255.255.255.0
interface Serial0/0/0
ip address 172.16.12.2 255.255.255.248
 no shutdown
interface Serial0/0/1
 ip address 172.16.23.2 255.255.255.248
no shutdown
End
Router R3
interface Lo3
 ip address 192.168.3.1 255.255.255.0
interface Serial0/0/0
 ip address 172.16.13.3 255.255.255.248
no shutdown
interface Serial0/0/1
 ip address 172.16.23.3 255.255.255.248
no shutdown
interface Serial0/1/0
ip address 172.16.34.3 255.255.255.248
no shutdown
End
Router R4
interface Lo4
ip address 192.168.4.1 255.255.255.128
interface Lo5
ip address 192.168.4.129 255.255.255.128
interface Serial0/0/0
 ip address 172.16.34.4 255.255.255.248
no shutdown
End
z. Verify the configuration with the show ip interface brief, show protocols, and show interfaces 
description commands. The output from router R3 is shown here as an example.
R3# show ip interface brief 
R3# show protocols 
R3# show interfaces description
Step 3: Configure basic EIGRP.
aa. Implement EIGRP AS 1 over the serial and loopback interfaces as you have configured it for the 
other EIGRP labs.
bb. Advertise networks 172.16.12.0/29, 172.16.13.0/29, 172.16.23.0/29, 172.16.34.0/29, 192.168.1.0/24, 
192.168.2.0/24, 192.168.3.0/24, and 192.168.4.0/24 from their respective routers.
You can copy and paste the following configurations into your routers.
Router R1
router eigrp 1
network 192.168.1.0
network 172.16.12.0 0.0.0.7
network 172.16.13.0 0.0.0.7
no auto-summary
Router R2
router eigrp 1
network 192.168.2.0
network 172.16.12.0 0.0.0.7
network 172.16.23.0 0.0.0.7
no auto-summary
Router R3
router eigrp 1
network 192.168.3.0
network 172.16.13.0 0.0.0.7
network 172.16.23.0 0.0.0.7
network 172.16.34.0 0.0.0.7
no auto-summary
Router R4
router eigrp 1
network 192.168.4.0
network 172.16.34.0 0.0.0.7
no auto-summary
You should see EIGRP neighbor relationship messages being generated.
Step 4: Verify EIGRP connectivity.
cc. Verify the configuration by using the show ip eigrp neighbors command to check which routers 
have EIGRP adjacencies.
R1# show ip eigrp neighbors
R2# show ip eigrp neighbors
R3# show ip eigrp neighbors
R4# show ip eigrp neighbors
dd. Run the following Tcl script on all routers to verify full connectivity.
R1# tclsh
Step 5: Verify the current path.
Before you configure PBR, verify the routing table on R1.
ee. On R1, use the show ip route command. Notice the next-hop IP address for all networks 
discovered by EIGRP. 
R1# show ip route
R4# traceroute 192.168.1.1 source 192.168.4.1
R4# traceroute 192.168.1.1 source 192.168.4.129
On R3, use the show ip route command and note that the preferred route from R3 to R1 LAN 
192.168.1.0/24 is via R2 using the R3 exit interface S0/0/1.
R3# show ip route
R3#
ff. On R3, use the show interfaces serial 0/0/0 and show interfaces s0/0/1 commands.
R3# show interfaces serial0/0/0
gg. Confirm that R3 has a valid route to reach R1 from its serial 0/0/0 interface using the show ip 
eigrp topology 192.168.1.0 command.
R3# show ip eigrp topology 192.168.1.0
Step 6: Configure PBR to provide path control.
The steps required to implement path control include the following:
− Choose the path control tool to use. Path control tools manipulate or bypass the IP routing table. 
For PBR, route-map commands are used.
− Implement the traffic-matching configuration, specifying which traffic will be manipulated. The 
match commands are used within route maps.
− Define the action for the matched traffic using set commands within route maps.
− Apply the route map to incoming traffic.
As a test, you will configure the following policy on router R3:
− All traffic sourced from R4 LAN A must take the R3 --> R2 --> R1 path. 
− All traffic sourced from R4 LAN B must take the R3 --> R1 path. 
hh. On router R3, create a standard access list called PBR-ACL to identify the R4 LAN B network.
R3(config)# ip access-list standard PBR-ACL
R3(config-std-nacl)# remark ACL matches R4 LAN B traffic
R3(config-std-nacl)# permit 192.168.4.128 0.0.0.127
R3(config-std-nacl)# exit
R3(config)#
ii. Create a route map called R3-to-R1 that matches PBR-ACL and sets the next-hop interface to the 
R1 serial 0/0/1 interface.
R3(config)# route-map R3-to-R1 permit
R3(config-route-map)# description RM to forward LAN B traffic to R1
R3(config-route-map)# match ip address PBR-ACL
R3(config-route-map)# set ip next-hop 172.16.13.1
R3(config-route-map)# exit
jj. Apply the R3-to-R1 route map to the serial interface on R3 that receives the traffic from R4. Use 
the ip policy route-map command on interface S0/1/0. 
R3(config)# interface s0/1/0
R3(config-if)# ip policy route-map R3-to-R1
R3(config-if)# end
kk. On R3, display the policy and matches using the show route-map command.
R3# show route-map
Step 7: Test the policy.
ll. On R3, create a standard ACL which identifies all of the R4 LANs.
R3# conf t
Enter configuration commands, one per line. End with CNTL/Z.
R3(config)# access-list 1 permit 192.168.4.0 0.0.0.255
R3(config)# exit
mm. Enable PBR debugging only for traffic that matches the R4 LANs.
R3# debug ip policy ?
R3# debug ip policy 1
nn. Test the policy from R4 with the traceroute command, using R4 LAN A as the source network.
R4# traceroute 192.168.1.1 source 192.168.4.1
oo. Test the policy from R4 with the traceroute command, using R4 LAN B as the source network.
R4# traceroute 192.168.1.1 source 192.168.4.129
pp. On R3, display the policy and matches using the show route-map command.
R3# show route-map
