Step 1: Configure interface addresses.
Router R1 (hostname ISP)
ISP(config)# interface Loopback0
ISP(config-if)# ip address 192.168.100.1 255.255.255.0
ISP(config-if)# exit
ISP(config)# interface Serial0/0/0
ISP(config-if)# ip address 192.168.1.5 255.255.255.252
ISP(config-if)# no shutdown
ISP(config-if)# exit
ISP(config)# interface Serial0/0/1
ISP(config-if)# ip address 192.168.1.1 255.255.255.252
ISP(config-if)# no shutdown
ISP(config-if)# end
Router R2 (hostname SanJose1)
SanJose1(config)# interface Loopback0
SanJose1(config-if)# ip address 172.16.64.1 255.255.255.0
SanJose1(config-if)# exit
SanJose1(config)# interface Serial0/0/0
SanJose1(config-if)# ip address 192.168.1.6 255.255.255.252
SanJose1(config-if)# no shutdown
SanJose1(config-if)# exit
SanJose1(config)# interface Serial0/0/1
SanJose1(config-if)# ip address 172.16.1.1 255.255.255.0
SanJose1(config-if)# no shutdown
SanJose1(config-if)# end
Router R3 (hostname SanJose2)
SanJose2(config)# interface Loopback0
SanJose2(config-if)# ip address 172.16.32.1 255.255.255.0
SanJose2(config-if)# exit
SanJose2(config)# interface Serial0/0/0
SanJose2(config-if)# ip address 192.168.1.2 255.255.255.252
SanJose2(config-if)# no shutdown
SanJose2(config-if)# exit
SanJose2(config)# interface Serial0/0/1
SanJose2(config-if)# ip address 172.16.1.2 255.255.255.0
SanJose2(config-if)# no shutdown
SanJose2(config-if)# end
Step 2: Configure EIGRP. 
Configure EIGRP between the SanJose1 and SanJose2 routers. (Note: If using an IOS prior to 15.0, use the 
no auto-summary router configuration command to disable automatic summarization. This command is 
the default beginning with IOS 15.)
SanJose1(config)# router eigrp 1
SanJose1(config-router)# network 172.16.0.0
SanJose2(config)# router eigrp 1
SanJose2(config-router)# network 172.16.0.0
Step 3: Configure IBGP and verify BGP neighbors. 
a. Configure IBGP between the SanJose1 and SanJose2 routers. On the SanJose1 router, enter the 
following configuration.
SanJose1(config)# router bgp 64512
SanJose1(config-router)# neighbor 172.16.32.1 remote-as 64512
SanJose1(config-router)# neighbor 172.16.32.1 update-source lo0
If multiple pathways to the BGP neighbor exist, the router can use multiple IP interfaces to communicate 
with the neighbor. The source IP address therefore depends on the outgoing interface. The update-source 
lo0 command instructs the router to use the IP address of the interface Loopback0 as the source IP 
address for all BGP messages sent to that neighbor. 
b. Complete the IBGP configuration on SanJose2 using the following commands.
SanJose2(config)# router bgp 64512
SanJose2(config-router)# neighbor 172.16.64.1 remote-as 64512
SanJose2(config-router)# neighbor 172.16.64.1 update-source lo0
c. Verify that SanJose1 and SanJose2 become BGP neighbors by issuing the show ip bgp neighbors 
command on SanJose1. View the following partial output. If the BGP state is not established, 
troubleshoot the connection.
SanJose2# show ip bgp neighbors
Step 4: Configure EBGP and verify BGP neighbors. 
d. Configure ISP to run EBGP with SanJose1 and SanJose2. Enter the following commands on ISP.
ISP(config)# router bgp 200
ISP(config-router)# neighbor 192.168.1.6 remote-as 64512
ISP(config-router)# neighbor 192.168.1.2 remote-as 64512
ISP(config-router)# network 192.168.100.0
e. Configure a discard static route for the 172.16.0.0/16 network. Any packets that do not have a 
more specific match (longer match) for a 172.16.0.0 subnet will be dropped instead of sent to the 
ISP. Later in this lab we will configure a default route to the ISP. 
SanJose1(config)# ip route 172.16.0.0 255.255.0.0 null0
f. Configure SanJose1 as an EBGP peer to ISP. 
SanJose1(config)# router bgp 64512
SanJose1(config-router)# neighbor 192.168.1.5 remote-as 200
SanJose1(config-router)# network 172.16.0.0
g. Use the show ip bgp neighbors command to verify that SanJose1 and ISP have reached the 
established state. Troubleshoot if necessary. 
SanJose1# show ip bgp neighbors
Configure a discard static route for 172.16.0.0/16 on SanJose2 and as an EBGP peer to ISP.
SanJose2(config)# ip route 172.16.0.0 255.255.0.0 null0
SanJose2(config)# router bgp 64512
SanJose2(config-router)# neighbor 192.168.1.1 remote-as 200
SanJose2(config-router)# network 172.16.0.0
Step 5: View BGP summary output.
In Step 4, the show ip bgp neighbors command was used to verify that SanJose1 and ISP had reached the 
established state. A useful alternative command is show ip bgp summary. The output should be similar 
to the following.
SanJose2# show ip bgp summary
Step 6: Verify which path the traffic takes.
f. Clear the IP BGP conversation with the clear ip bgp * command on ISP. Wait for the conversations to 
reestablish with each SanJose router.
ISP# clear ip bgp *
g. Test whether ISP can ping the loopback 0 address of 172.16.64.1 on SanJose1 and the serial link 
between SanJose1 and SanJose2, 172.16.1.1.
ISP# ping 172.16.64.1
ISP# ping 172.16.1.1
h. Now ping from ISP to the loopback 0 address of 172.16.32.1 on SanJose2 and the serial link 
between SanJose1 and SanJose2, 172.16.1.2.
ISP# ping 172.16.32.1
ISP# ping 172.16.1.2 
I. Issue the show ip bgp command on ISP to verify BGP routes and metrics.
ISP# show ip bgp
i. At this point, the ISP router should be able to get to each network connected to SanJose1 and 
SanJose2 from the loopback address 192.168.100.1. Use the extended ping command and specify 
the source address of ISP Lo0 to test.
ISP# ping 172.16.1.1 source 192.168.100.1
ISP# ping 172.16.32.1 source 192.168.100.1
ISP# ping 172.16.1.2 source 192.168.100.1
ISP# ping 172.16.64.1 source 192.168.100.1
Step 7: Configure the BGP next-hop-self feature.
j. Issue the following commands on the ISP router.
ISP(config)# router bgp 200
ISP(config-router)# network 192.168.1.0 mask 255.255.255.252
ISP(config-router)# network 192.168.1.4 mask 255.255.255.252
k. Issue the show ip bgp command to verify that the ISP is correctly injecting its own WAN links 
into BGP.
ISP# show ip bgp
l. Verify on SanJose1 and SanJose2 that the opposite WAN link is included in the routing table. The 
output from SanJose2 is as follows.
SanJose2# show ip route
m. To better understand the next-hop-self command we will remove ISP advertising its two WAN 
links and shutdown the WAN link between ISP and SanJose2. The only possible path from 
SanJose2 to ISP’s 192.168.100.0/24 is through SanJose1.
ISP(config)# router bgp 200
ISP(config-router)# no network 192.168.1.0 mask 255.255.255.252
ISP(config-router)# no network 192.168.1.4 mask 255.255.255.252
ISP(config-router)# exit
ISP(config)# interface serial 0/0/1
ISP(config-if)# shutdown
n. Display SanJose2’s BGP table using the show ip bgp command and the IPv4 routing table with 
show ip route. 
SanJose2# show ip bgp
SanJose2# show ip route
SanJose1(config)# router bgp 64512
SanJose1(config-router)# neighbor 172.16.32.1 next-hop-self
SanJose2(config)# router bgp 64512
SanJose2(config-router)# neighbor 172.16.64.1 next-hop-self
o. Reset BGP operation on either router with the clear ip bgp * command.
SanJose1# clear ip bgp * 
SanJose2# clear ip bgp * 
p. After the routers have returned to established BGP speakers, issue the show ip bgp command on 
SanJose2 and notice that the next hop is now SanJose1 instead of ISP.
SanJose2# show ip bgp
q. The show ip route command on SanJose2 now displays the 192.168.100.0/24 network because 
SanJose1 is the next hop, 172.16.64.1, which is reachable from SanJose2.
SanJose2# show ip route
r. Before configuring the next BGP attribute, restore the WAN link between ISP and SanJose3. This 
will change the BGP table and routing table on both routers. For example, SanJose2’s routing 
table shows 192.168.100.0/24 will now have a better path through ISP.
ISP(config)# interface serial 0/0/1
ISP(config-if)# no shutdown
SanJose2# show ip route
Step 8: Set BGP local preference.
s. Because the local preference value is shared between IBGP neighbors, configure a simple route 
map that references the local preference value on SanJose1 and SanJose2. This policy adjusts 
outbound traffic to prefer the link off the SanJose1 router instead of the metered T1 off SanJose2.
SanJose1(config)# route-map PRIMARY_T1_IN permit 10
SanJose1(config-route-map)# set local-preference 150
SanJose1(config-route-map)# exit
SanJose1(config)# router bgp 64512
SanJose1(config-router)# neighbor 192.168.1.5 route-map PRIMARY_T1_IN in
SanJose2(config)# route-map SECONDARY_T1_IN permit 10
SanJose2(config-route-map)# set local-preference 125
SanJose1(config-route-map)# exit
SanJose2(config)# router bgp 64512
SanJose2(config-router)# neighbor 192.168.1.1 route-map SECONDARY_T1_IN in
t. Use the clear ip bgp * soft command after configuring this new policy. When the conversations 
have been reestablished, issue the show ip bgp command on SanJose1 and SanJose2.
SanJose1# clear ip bgp * soft
SanJose2# clear ip bgp * soft
SanJose1# show ip bgp
SanJose2# show ip bgp
Step 9: Set BGP MED.
u. In the previous step we saw that SanJose1 and SanJose2 will route traffic for 192.168.100.0/24 
using the link between SanJose1 and ISP. Examine what the return path ISP takes to reach AS 
64512. Notice that the return path is different from the original path. This is known as 
asymmetric routing and is not necessarily an unwanted trait.
ISP# show ip bgp
ISP# show ip route
a. Use an extended ping command to verify this situation. Specify the record option and compare 
your output to the following. Notice the return path using the exit interface 192.168.1.1 to 
SanJose2
If you are unfamiliar with the record option, the important thing to note is that each IP address in 
brackets is an outgoing interface. The output can be interpreted as follows:
1. A ping that is sourced from 172.16.32.1 exits SanJose2 through s0/0/1, 172.16.1.2. It then arrives 
at the s0/0/1 interface for SanJose1.
2. SanJose1 S0/0/0, 192.168.1.6, routes the packet out to arrive at the S0/0/0 interface of ISP.
3. The target of 192.168.100.1 is reached: 192.168.100.1.
4. The packet is next forwarded out the S0/0/1, 192.168.1.1 interface for ISP and arrives at the 
S0/0/0 interface for SanJose2.
5. SanJose2 then forwards the packet out the last interface, loopback 0, 172.16.32.1.
Although the unlimited use of the T1 from SanJose1 is preferred here, ISP currently takes the link from 
SanJose2 for all return traffic.
b. Create a new policy to force the ISP router to return all traffic via SanJose1. Create a second route 
map utilizing the MED (metric) that is shared between EBGP neighbors.
SanJose1(config)#route-map PRIMARY_T1_MED_OUT permit 10
SanJose1(config-route-map)#set Metric 50
SanJose1(config-route-map)#exit
SanJose1(config)#router bgp 64512
SanJose1(config-router)#neighbor 192.168.1.5 route-map PRIMARY_T1_MED_OUT out
SanJose2(config)#route-map SECONDARY_T1_MED_OUT permit 10
SanJose2(config-route-map)#set Metric 75
SanJose2(config-route-map)#exit
SanJose2(config)#router bgp 64512
SanJose2(config-router)#neighbor 192.168.1.1 route-map SECONDARY_T1_MED_OUT out
v. Use the clear ip bgp * soft command after issuing this new policy. Issuing the show ip bgp
command as follows on SanJose1 or SanJose2 does not indicate anything about this newly 
defined policy.
SanJose1# clear ip bgp * soft
SanJose2# clear ip bgp * soft
SanJose1# show ip bgp
SanJose2# show ip bgp
Reissue an extended ping command with the record command. Notice the change in return path using 
the exit interface 192.168.1.5 to SanJose1.
ISP# show ip bgp
Step 10: Establish a default route.
The final step is to establish a default route that uses a policy statement that adjusts to changes in the 
network. 
a. Configure ISP to inject a default route to both SanJose1 and SanJose2 using BGP using the 
default-originate command. This command does not require the presence of 0.0.0.0 in the ISP 
router. Configure the 10.0.0.0/8 network which will not be advertised using BGP. This network 
will be used to test the default route on SanJose1 and SanJose2.
ISP(config)# router bgp 200
ISP(config-router)# neighbor 192.168.1.6 default-originate
ISP(config-router)# neighbor 192.168.1.2 default-originate
ISP(config-router)# exit
ISP(config)# interface loopback 10 
ISP(config-if)# ip address 10.0.0.1 255.255.255.0
b. Verify that both routers have received the default route by examining the routing tables on 
SanJose1 and SanJose2. Notice that both routers prefer the route between SanJose1 and ISP.
SanJose1# show ip route
SanJose2# show ip route
c. The preferred default route is by way of SanJose1 because of the higher local preference attribute 
configured on SanJose1 earlier.
SanJose2# show ip bgp
d. Using the traceroute command verify that packets to 10.0.0.1 is using the default route through 
SanJose1.
SanJose2# traceroute 10.0.0.1
e. Next, test how BGP adapts to using a different default route when the path between SanJose1 and 
ISP goes down.
ISP(config)# interface serial 0/0/0
ISP(config-if)# shutdown
f. Verify that both routers are modified their routing tables with the default route using the path 
between SanJose2 and ISP.
SanJose1# show ip route
SanJose2# show ip route
g. Verify the new path using the traceroute command to 10.0.0.1 from SanJose1. Notice the default 
route is now through SanJose2.
SanJose1# trace 10.0.0.1
